#+TITLE:     Exploring electronic music heritage
#+SUBTITLE: through ethics and improvisation
#+EMAIL:    henrik.frisk@kmh.se
#+NAME: Henrik Frisk
#+DATE: November 20, 2023
#+DESCRIPTION:
#+STARTUP: indent
#+STARTUP: overview
#+KEYWORDS: teaching, composition
#+LANGUAGE: en
#+OPTIONS: toc:nil num:nil

# #+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js

#+REVEAL_INIT_OPTIONS: width:1200, height:800, controlsLayout: 'edges'
#+REVEAL_THEME: black
#+REVEAL_TRANS: none
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h3>%s</h3><p>%d</p><p>%a - %e</p>
#+REVEAL_TITLE_SLIDE_BACKGROUND: ./img/kmh-white2.png
#+REVEAL_TITLE_SLIDE_BACKGROUND_SIZE: 1600px
#+REVEAL_TITLE_SLIDE_BACKGROUND_REPEAT: 
#+REVEAL_SLIDE_FOOTER:
#+REVEAL_MARGIN: 0.1

# title slide background
#+REVEAL_DEFAULT_SLIDE_BACKGROUND:
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_SIZE:
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_POSITION:
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_REPEAT:
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_TRANSITION:

# Change the MIN_SCALE to make the presentation fit in a smaller window. 
# See also the script at the bottom of the generated file

#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_HLEVEL: 1
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Slide presentation.">
#+REVEAL_POSTAMBLE: <p> Henrik Frisk </p>
#+REVEAL_PLUGINS: (markdown notes)
#+REVEAL_DEFAULT_FRAG_STYLE: fade-out
#+REVEAL_EXTRA_CSS: ./local.css

#+MACRO: color @@html:<font color="$1">$2</font>@@

* COMMENT Tree slide settings
#+begin_src emacs-lisp
  (when (require 'org-tree-slide nil t)
    (setq org-tree-slide-skip-comments 'inherit)
    (setq org-tree-slide-skip-done nil)
    (require 'org-tree-slide-pauses)
    (setq org-image-actual-width nil)
    (setq org-tree-slide-content-margin-top 5)
    )

  ;; For a light theme
;;    (load-theme 'tango t)
   (custom-set-faces
;;    '(org-quote ((t (:inherit org-block :background "white smoke"))))
    '(org-tree-slide-header-overlay-face ((t (:inherit default))))
 ;;   '(shadow ((t (:foreground "gainsboro"))))
    )
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (set-window-margins (selected-window) 40 40)
  (setq line-spacing 0.5)
  ;; (text-scale-increase 1)
  (setq org-fontify-emphasized-text 1)
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.0))
;;  (set-frame-font "Helvetica 12" nil t)
#+end_src

#+RESULTS:
| :foreground | default | :background | default | :scale | 1.0 | :html-foreground | Black | :html-background | Transparent | :html-scale | 1.0 | :matchers | (begin $1 $ $$ \( \[) |

